In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('ships.csv')
df

              name        lat        lng
0      Black Pearl  20.664865 -80.709747
1            Cobra  20.664868 -80.709740
2  Flying Dutchman  20.664878 -80.709941
3          Empress        NaN        NaN

In [4]:
df.dtypes

name     object
lat     float64
lng     float64
dtype: object